risk_categories = {
    "Umumiy": {
        "✅": "Сизда саломатлик билан боғлиқ жиддий муаммолар йўқ.",
        "⚠": "Сизда баъзи хавф омиллари бор, шифокор маслаҳати тавсия этилади",
        "🚨": "Сизга чек-ап саволнома натижаларига асосланган тўлиқ тиббий текширув зарур."
    },
    "Kardio": {
        "✅": "Юрак-қон томир саломатлигингиз яхши, лекин даврий текширувлардан ўтиш тавсия этилади.",
        "⚠": "Юрак-қон томир хавфи бор, мутахассис шифокорга мурожаат қилинг.",
        "🚨": "Юрак-қон томир касалликлари хавфи юқори! Тез орада кардиолог кўригидан ўтиш тавсия этилади."
    },
    "Neyro":{
        "✅": "Асаб тизими саломатлиги яхши, лекин даврий текширувлар тавсия этилади.",
        "⚠": "Неврологик хавф бор, мутахассис шифокорга мурожаат қилинг.",
        "🚨": "Асаб тизимида жиддий муаммолар бўлиши мумкин! Тез орада невропатолог кўригидан ўтиш тавсия этилади."
    },
    "Onko": {
        "✅": "Хавф паст, лекин даврий онкологик текширувлар тавсия этилади.",
        "⚠": "Онкологик хавф мавжуд, мутахассис шифокорга мурожаат қилинг.",
        "🚨": "Юқори хавф! Онколог маслаҳати ва чуқур диагностика ўтказиш зарур."
    },
    "Bolajon": {
        "✅": "Боланинг соғлиғи яхши, лекин мунтазам тиббий текширувдан ўтиб туриш тавсия этилади.",
        "⚠": "Баъзи хавф омиллари бор, педиатр ёки мутахассисга мурожаат қилинг.",
        "🚨": "Юқори хавф! Тезроқ тиббий кўрикдан ўтиш лозим."
    },
    "Nuroniy": {
        "✅": "Ҳавф паст, лекин мунтазам тиббий текширувдан ўтиш тавсия этилади.",
        "⚠": "Баъзи хавф омиллари бор, шифокорга мурожаат қилиш лозим.",
        "🚨": "Юқори хавф! Тезда мутахассис шифокор текширувидан ўтиш керак."
    },
    "Yosh Oila": {
        "✅": "Барча жойида! Лекин, тўлиқ тиббий текширувдан ўтиш ҳам фойдали.",
        "⚠": "Баъзи муаммолар бор, шифокор билан маслаҳатлашиш керак.",
        "🚨": "Жиддий хавф! Чуқурлаштирилган тиббий кўрикдан ўтиш лозим."
    },
    "Erkaklar": {
        "✅": "Барча жойида! Лекин мунтазам тиббий текширувдан ўтиш тавсия этилади.",
        "⚠": "Баъзи муаммолар бор, шифокорга мурожаат қилиш керак.",
        "🚨": "Жиддий хавф! Чуқурлаштирилган тиббий кўрикдан ўтиш зарур."
    },
    "Ayollar": {
        "✅": "Соғлиғингиз яхши! Лекин мунтазам тиббий текширувдан ўтиш тавсия этилади.",
        "⚠": "Баъзи муаммолар бор, шифокорга мурожаат қилиш керак.",
        "🚨": "Жиддий хавф! Касбий тиббий кўрикдан ўтиш зарур."
    }
}
